_notes/_posts/technology/2023-04-02-cppcoreguidelines-es25.org
#+layout: post
#+title: CppCoreGuidelines ES.25 把对象声明为 const 或 constexpr，除非之后要修改
#+categories: technology
#+tags: CppCoreGuidelines

[[http://kimi.im/tags.html#CppCoreGuidelines-ref][C++ 核心指南目录]]

"Declare an object ~const~ or ~constexpr~ unless you want to modify its
value later on"

理由

这样你不会一不留神改值。还可能给编译器提供优化的机会。

例子

#+begin_src C++ :exports both :flags -std=c++20 :namespaces std :includes  <iostream> <vector> <algorithm> :eval no-export :results output
void f(int n)
{
    const int bufmax = 2 * n + 2;  // good: we can't change bufmax by accident
    int xmax = n;                  // suspicious: is xmax intended to change?
    // ...
}
#+end_src


强化

检查变量是否实际改动，不然打上标记。
